# Devanagari to Bengali mapping

സാധാരണാക്ഷരം = { #সাধারণাক্ষর
    # Numbers
    '०': '০', '१': '১', '२': '২', '३': '৩', '४': '৪', '५': '৫', '६': '৬', '७': '৭', '८': '৮', '९': '৯',

    # Vowels
    'अ': 'অ', 'आ': 'আ', 'इ': 'ই', 'ई': 'ঈ', 'उ': 'উ', 'ऊ': 'ঊ',
    'ऋ': 'ঋ', 'ॠ': 'ৠ', 'ऌ': 'ঌ', 'ॡ': 'ৡ', 
    'ऎ': 'এ', 'ए': 'এ', 'ऐ': 'ঐ',
    'ऒ': 'ও', 'ओ': 'ও', 'औ': 'ঔ',
    'अं': 'অং', 'अः': 'অঃ',

    # Consonants
    'क': 'ক', 'ख': 'খ', 'ग': 'গ', 'घ': 'ঘ', 'ङ': 'ঙ',
    'च': 'চ', 'छ': 'ছ', 'ज': 'জ', 'झ': 'ঝ', 'ञ': 'ঞ',
    'ट': 'ট', 'ठ': 'ঠ', 'ड': 'ড', 'ढ': 'ঢ', 'ण': 'ণ',
    'त': 'ত', 'थ': 'থ', 'द': 'দ', 'ध': 'ধ', 'न': 'ন',
    'प': 'প', 'फ': 'ফ', 'ब': 'ব', 'भ': 'ভ', 'म': 'ম',
    'य': 'য', 'र': 'র', 'ल': 'ল', 'व': 'ৱ',
    'श': 'শ', 'ष': 'ষ', 'स': 'স', 'ह': 'হ',
    'ळ': 'ল', 'ऱ': 'ড়', 'ऴ': 'ঢ়',

    # Vowel signs
    'ा': 'া', 'ि': 'ি', 'ी': 'ী', 'ु': 'ু', 'ू': 'ূ', 'ृ': 'ৃ',
    'ॆ': 'ে', 'े': 'ে', 'ै': 'ৈ', 'ॊ': 'ো', 'ो': 'ো', 'ौ': 'ৌ',
    'ं': 'ং', 'ः': 'ঃ',
    'ऽ': 'ঽ',

    '्': '্', # Virama
    'ँ': 'ঁ', # Chandrabindu
}

വാക്യവിരാമം = { #বাক্যবিরাম
    '।': '.' # वाक्य विराम
}

ചില്ലക്ഷരം = { #চিলক্ষর
    'ऩ्': 'ন্', 'ण़्': 'ণ্',
    'ळ्': 'ল্', 'ल़्': 'ল্',
    'ल्': 'ল্', 'ऴ्': 'ঢ়্',

    'म़्': 'ং', 'क़्': 'ক্', 'य़्': 'য্', 'ऴ़्': 'ঢ়্',
    'र्': 'র্',
    'र्य': 'র্য',
    'ऱ्': 'র্', 'ऱ़्': 'র্',
    'ऱ्र्': 'ট্র', 'ऱ्र': 'ট্র', 'ऱ्ऱ्': 'ট্র'
}

നുക്താക്ഷരം = { #নুক্তাক্ষর
    'व़': 'ৱ', # Special usage for Bengali, can be adjusted as needed
    'ज़': 'জ়', # Special usage for Bengali, can be adjusted as needed
    'फ़': 'ফ়', # Special usage for Bengali, can be adjusted as needed
    'य़': 'য়', # Special usage for Bengali, can be adjusted as needed
}

നുക്തം = { #নুক্তম
    '़': '​'  # Placeholder for Nukta
}
