# Devanagari to Punjabi mapping

സാധാരണാക്ഷരം = { #ਸਧਾਰਨਅੱਖਰ
    # Numbers
    '०': '੦', '१': '੧', '२': '੨', '३': '੩', '४': '੪', '५': '੫', '६': '੬', '७': '੭', '८': '੮', '९': '੯',

    # Vowels
    'अ': 'ਅ', 'आ': 'ਆ', 'इ': 'ਇ', 'ई': 'ਈ', 'उ': 'ਉ', 'ऊ': 'ਊ',
    'ऋ': 'ੲ', 'ॠ': 'ੳ', 'ऌ': 'ਲ਼', 'ॡ': 'ਲ਼਼', 
    'ऎ': 'ਏ', 'ए': 'ਏ', 'ऐ': 'ਐ',
    'ऒ': 'ਓ', 'ओ': 'ਓ', 'औ': 'ਔ',
    'अं': 'ਅੰ', 'अः': 'ਅਃ',

    # Consonants
    'क': 'ਕ', 'ख': 'ਖ', 'ग': 'ਗ', 'घ': 'ਘ', 'ङ': 'ਙ',
    'च': 'ਚ', 'छ': 'ਛ', 'ज': 'ਜ', 'झ': 'ਝ', 'ञ': 'ਞ',
    'ट': 'ਟ', 'ठ': 'ਠ', 'ड': 'ਡ', 'ढ': 'ਢ', 'ण': 'ਣ',
    'त': 'ਤ', 'थ': 'ਥ', 'द': 'ਦ', 'ध': 'ਧ', 'न': 'ਨ',
    'प': 'ਪ', 'फ': 'ਫ', 'ब': 'ਬ', 'भ': 'ਭ', 'म': 'ਮ',
    'य': 'ਯ', 'र': 'ਰ', 'ल': 'ਲ', 'व': 'ਵ',
    'श': 'ਸ਼', 'ष': 'ਸ਼਼', 'स': 'ਸ', 'ह': 'ਹ',
    'ळ': 'ਲ਼', 'ऱ': 'ੜ', 'ऴ': 'ਲ਼',

    # Vowel signs
    'ा': 'ਾ', 'ि': 'ਿ', 'ी': 'ੀ', 'ु': 'ੁ', 'ू': 'ੂ', 'ृ': '੃',
    'ॆ': 'ੇ', 'े': 'ੇ', 'ै': 'ੈ', 'ॊ': 'ੋ', 'ो': 'ੋ', 'ौ': 'ੌ',
    'ं': 'ਂ', 'ः': 'ਃ',
    'ऽ': '਽',

    '्': '੍', # Virama
    'ँ': 'ਁ', # Chandrabindu
}

വാക്യവിരാമം = { #ਵਾਕਵਿਰਾਮ
    '।': '.' # वाक्य विराम
}

ചില്ലക്ഷരം = { #ਚਿਲਲਕ੍ਸ਼ਰ
    'ऩ्': 'ਨ੍', 'ण़्': 'ਣ੍',
    'ळ्': 'ਲ਼੍', 'ल़्': 'ਲ੍',
    'ल्': 'ਲ੍', 'ऴ्': 'ਲ਼੍',

    'म़्': 'ਂ', 'क़्': 'ਕ੍', 'य़्': 'ਯ੍', 'ऴ़्': 'ਲ਼੍',
    'र्': 'ਰ੍',
    'र्य': 'ਰ੍ਯ',
    'ऱ्': 'ਰ੍', 'ऱ़्': 'ਰ੍',
    'ऱ्र्': 'ਟ੍ਰ', 'ऱ्र': 'ਟ੍ਰ', 'ऱ्ऱ्': 'ਟ੍ਰ'
}

നുക്താക്ഷരം = { #ਨੁਕ੍ਤਾਅਕ੍ਸ਼ਰ
    'व़': 'ਵ਼', # Special usage for Punjabi
    'ज़': 'ਜ਼', # Special usage for Punjabi
    'फ़': 'ਫ਼', # Special usage for Punjabi
    'य़': 'ਯ਼', # Special usage for Punjabi
}

നുക്തം = { #ਨੁਕ੍ਤਮ
    '़': '​'  # Placeholder for Nukta
}