# Devanagari to Gujarati mapping

സാധാരണാക്ഷരം = { #સાધારણાક્ષર
    # Numbers
    '०': '૦', '१': '૧', '२': '૨', '३': '૩', '४': '૪', '५': '૫', '६': '૬', '७': '૭', '८': '૮', '९': '૯',

    # Vowels
    'अ': 'અ', 'आ': 'આ', 'इ': 'ઇ', 'ई': 'ઈ', 'उ': 'ઉ', 'ऊ': 'ઊ',
    'ऋ': 'ઋ', 'ॠ': 'ૠ', 'ऌ': 'ઌ', 'ॡ': 'ૡ', 
    'ऎ': 'ઍ', 'ए': 'એ', 'ऐ': 'ઐ',
    'ऒ': 'ઑ', 'ओ': 'ઓ', 'औ': 'ઔ',
    'अं': 'અં', 'अः': 'અઃ',

    # Consonants
    'क': 'ક', 'ख': 'ખ', 'ग': 'ગ', 'घ': 'ઘ', 'ङ': 'ઙ',
    'च': 'ચ', 'छ': 'છ', 'ज': 'જ', 'झ': 'ઝ', 'ञ': 'ઞ',
    'ट': 'ટ', 'ठ': 'ઠ', 'ड': 'ડ', 'ढ': 'ઢ', 'ण': 'ણ',
    'त': 'ત', 'थ': 'થ', 'द': 'દ', 'ध': 'ધ', 'न': 'ન',
    'प': 'પ', 'फ': 'ફ', 'ब': 'બ', 'भ': 'ભ', 'म': 'મ',
    'य': 'ય', 'र': 'ર', 'ल': 'લ', 'व': 'વ',
    'श': 'શ', 'ष': 'ષ', 'स': 'સ', 'ह': 'હ',
    'ळ': 'ળ', 'ऱ': 'ર઼', 'ऴ': 'ળ઼',

    # Vowel signs
    'ा': 'ા', 'ि': 'િ', 'ी': 'ી', 'ु': 'ુ', 'ू': 'ૂ', 'ृ': 'ૃ',
    'ॆ': 'ે', 'े': 'ે', 'ै': 'ૈ', 'ॊ': 'ો', 'ो': 'ો', 'ौ': 'ૌ',
    'ं': 'ં', 'ः': 'ઃ',
    'ऽ': 'ઽ',

    '्': '્', # Virama
    'ँ': 'ઁ', # Chandrabindu
}

വാക്യവിരാമം = { #વાક્યવિરામ
    '।': '.' # वाक्य विराम
}

ചില്ലക്ഷരം = { #ચિલ્લક્ષર
    'ऩ्': 'ન્', 'ण़्': 'ણ્',
    'ळ्': 'ળ્', 'ल़्': 'લ્',
    'ल्': 'લ્', 'ऴ्': 'ળ઼્',

    'म़्': 'ં', 'क़्': 'ક્', 'य़्': 'ય્', 'ऴ़्': 'ળ્',
    'र्': 'ર્',
    'र्य': 'ર્ય',
    'ऱ्': 'ર્', 'ऱ़्': 'ર઼્',
    'ऱ्र्': 'ટ્ર', 'ऱ्र': 'ટ્ર', 'ऱ्ऱ्': 'ટ્ર'
}

നുക്താക്ഷരം = { #નુક્તાક્ષર
    'व़': 'વ઼', # Special usage for Gujarati, can be adjusted as needed
    'ज़': 'જ઼', # Special usage for Gujarati, can be adjusted as needed
    'फ़': 'ફ઼', # Special usage for Gujarati, can be adjusted as needed
    'य़': 'ય઼', # Special usage for Gujarati, can be adjusted as needed
}

നുക്തം = { #નુક્તમ
    '़': '​'  # Placeholder for Nukta
}
