# Devanagari to Telugu mapping

സാധാരണാക്ഷരം = { #సాధారణాక్షరం
    # Numbers
    '०': '౦', '१': '౧', '२': '౨', '३': '౩', '४': '౪', '५': '౫', '६': '౬', '७': '౭', '८': '౮', '९': '౯',

    # Vowels
    'अ': 'అ', 'आ': 'ఆ', 'इ': 'ఇ', 'ई': 'ఈ', 'उ': 'ఉ', 'ऊ': 'ఊ',
    'ऋ': 'ఋ', 'ॠ': 'ౠ', 'ऌ': 'ఌ', 'ॡ': 'ౡ', 
    'ऎ': 'ఎ', 'ए': 'ఏ', 'ऐ': 'ఐ',
    'ऒ': 'ఒ', 'ओ': 'ఓ', 'औ': 'ఔ',
    'अं': 'అం', 'अः': 'అః',

    # Consonants
    'क': 'క', 'ख': 'ఖ', 'ग': 'గ', 'घ': 'ఘ', 'ङ': 'ఙ',
    'च': 'చ', 'छ': 'ఛ', 'ज': 'జ', 'झ': 'ఝ', 'ञ': 'ఞ',
    'ट': 'ట', 'ठ': 'ఠ', 'ड': 'డ', 'ढ': 'ఢ', 'ण': 'ణ',
    'त': 'త', 'थ': 'థ', 'द': 'ద', 'ध': 'ధ', 'न': 'న',
    'प': 'ప', 'फ': 'ఫ', 'ब': 'బ', 'भ': 'భ', 'म': 'మ',
    'य': 'య', 'र': 'ర', 'ल': 'ల', 'व': 'వ',
    'श': 'శ', 'ष': 'ష', 'स': 'స', 'ह': 'హ',
    'ळ': 'ళ', 'ऱ': 'ఱ', 'ऴ': 'ఴ',

    # Vowel signs
    'ा': 'ా', 'ि': 'ి', 'ी': 'ీ', 'ु': 'ు', 'ू': 'ూ', 'ृ': 'ృ',
    'ॆ': 'ె', 'े': 'ే', 'ै': 'ై', 'ॊ': 'ొ', 'ो': 'ో', 'ौ': 'ౌ',
    'ं': 'ం', 'ः': 'ః',
    'ऽ': 'ఽ',

    '्': '్', # Virama
    'ँ': 'ఁ', # Chandrabindu
}

വാക്യവിരാമം = { #వాక్యవిరామం
    '।': '.' # वाक्य विराम
}

ചില്ലക്ഷരം = { #చిలక్షరం
    'ऩ्': 'న్', 'ण़्': 'ణ్',
    'ळ्': 'ళ్', 'ल़्': 'ల్',
    'ल्': 'ల్', 'ऴ्': 'ఴ్',

    'म़्': 'ం', 'क़्': 'క్', 'य़्': 'య్', 'ऴ़्': 'ఴ్',
    'र्': 'ర్',
    'र्य': 'ర్య',
    'ऱ्': 'ర్', 'ऱ़्': 'ర్',
    'ऱ्र्': 'ట్ర', 'ऱ्र': 'ట్ర', 'ऱ्ऱ्': 'ట్ర'
}

നുക്താക്ഷരം = { #నుక్తాక్షరం
    'व़': 'వ़', # Special usage for Telugu, can be adjusted as needed
    'ज़': 'జ़', # Special usage for Telugu, can be adjusted as needed
    'फ़': 'ఫ़', # Special usage for Telugu, can be adjusted as needed
    'य़': 'య਼', # Special usage for Telugu, can be adjusted as needed
}

നുക്തം = { #నుక్తం
    '़': '​'  # Placeholder for Nukta
}
