# Devanagari to Kannada mapping

സാധാരണാക്ഷരം = { #ಸಾಧಾರಣಾಕ್ಷರ
    # Numbers
    '०': '೦', '१': '೧', '२': '೨', '३': '೩', '४': '೪', '५': '೫', '६': '೬', '७': '೭', '८': '೮', '९': '೯',

    # Vowels
    'अ': 'ಅ', 'आ': 'ಆ', 'इ': 'ಇ', 'ई': 'ಈ', 'उ': 'ಉ', 'ऊ': 'ಊ',
    'ऋ': 'ಋ', 'ॠ': 'ೠ', 'ऌ': 'ಌ', 'ॡ': 'ೡ', 
    'ऎ': 'ಎ', 'ए': 'ಏ', 'ऐ': 'ಐ',
    'ऒ': 'ಒ', 'ओ': 'ಓ', 'औ': 'ಔ',
    'अं': 'ಅಂ', 'अः': 'ಅಃ',

    # Consonants
    'क': 'ಕ', 'ख': 'ಖ', 'ग': 'ಗ', 'घ': 'ಘ', 'ङ': 'ಙ',
    'च': 'ಚ', 'छ': 'ಛ', 'ज': 'ಜ', 'झ': 'ಝ', 'ञ': 'ಞ',
    'ट': 'ಟ', 'ठ': 'ಠ', 'ड': 'ಡ', 'ढ': 'ಢ', 'ण': 'ಣ',
    'त': 'ತ', 'थ': 'ಥ', 'द': 'ದ', 'ध': 'ಧ', 'न': 'ನ',
    'प': 'ಪ', 'फ': 'ಫ', 'ब': 'ಬ', 'भ': 'ಭ', 'म': 'ಮ',
    'य': 'ಯ', 'र': 'ರ', 'ल': 'ಲ', 'व': 'ವ',
    'श': 'ಶ', 'ष': 'ಷ', 'स': 'ಸ', 'ह': 'ಹ',
    'ळ': 'ಳ', 'ऱ': 'ಱ', 'ऴ': 'ೞ',

    # Vowel signs
    'ा': 'ಾ', 'ि': 'ಿ', 'ी': 'ೀ', 'ु': 'ು', 'ू': 'ೂ', 'ृ': 'ೃ',
    'ॆ': 'ೆ', 'े': 'ೇ', 'ै': 'ೈ', 'ॊ': 'ೊ', 'ो': 'ೋ', 'ौ': 'ೌ',
    'ं': 'ಂ', 'ः': 'ಃ',
    'ऽ': 'ಽ',

    '्': '್', # Virama
    'ँ': 'ಁ', # Chandrabindu
}

വാക്യവിരാമം = { #ವಾಕ್ಯವಿರಾಮ
    '।': '.' # वाक्य विराम
}

ചില്ലക്ഷരം = { #ಚಿಲ್ಲಕ್ಷರ
    'ऩ्': 'ನ್', 'ण़्': 'ಣ್',
    'ळ्': 'ಳ್', 'ल़्': 'ಲ್',
    'ल्': 'ಲ್', 'ऴ्': 'ೞ್',

    'म़्': 'ಂ', 'क़्': 'ಕ್', 'य़्': 'ಯ್', 'ऴ़्': 'ೞ್',
    'र्': 'ರ್',
    'र्य': 'ರ್ಯ',
    'ऱ्': 'ರ್', 'ऱ़्': 'ರ್',
    'ऱ्र्': 'ಟ್ರ', 'ऱ्र': 'ಟ್ರ', 'ऱ्ऱ्': 'ಟ್ರ'
}

നുക്താക്ഷരം = { #ನುಕ್ತಾಕ್ಷರ
    'व़': 'ಔ', # Special usage for Kannada, can be adjusted as needed
    'ज़': 'ಜ಼', # Special usage for Kannada, can be adjusted as needed
    'फ़': 'ಫ಼', # Special usage for Kannada, can be adjusted as needed
    'य़': 'ಯ಼', # Special usage for Kannada, can be adjusted as needed
}

നുക്തം = { #ನುಕ್ತಂ
    '़': '​'  # Placeholder for Nukta
}
