# ദേവനാഗരിയിൽ നിന്ന് മലയാളത്തിലേക്കുള്ള പൊരുത്ത-നിഘണ്ടു

സാധാരണാക്ഷരം = {
    # സംഖ്യകൾ
    '०': '൦', '१': '൧', '२': '൨', '३': '൩', '४': '൪', '५': '൫', '६': '൬', '७': '൭', '८': '൮', '९': '൯', #ഇത് ഉപയോഗിക്കാതിരുക്കുന്നതാണ് ഉചിതം എന്തെന്നാൽ 1,2,3 എന്നിവ ബ്രാഹ്മി ലിപിയാണ് (ഗ്രന്ഥത്തിൻറ്റെയും, നാഗരിയുടേയും അമ്മ), ഇത് ലോകം മൊത്തം സ്വീകരിച്ചിരിക്കുന്നു. അതിനാൽ ഇത് നമ്മുടെ വിജയം കണക്കാക്കി ഇത് തന്നെ ഉപയോഗിക്കുക.

    # സ്വരാക്ഷരങ്ങൾ
    'अ': 'അ', 'आ': 'ആ', 'इ': 'ഇ', 'ई': 'ഈ', 'उ': 'ഉ', 'ऊ': 'ഊ',
    'ऋ': 'ഋ', 'ॠ': 'ൠ', 'ऌ': 'ഌ', 'ॡ': 'ൡ', 
    'ऎ': 'ഏ', 'ए': 'എ', 'ऐ': 'ഐ', #ഇതിൽ ദേവനാഗരിയിലെ എ-യും ഏ-യും പരസ്പരം തിരിച്ചിടുണ്ട്. പക്ഷെ ഇത് നാഗരിക്കാർ ഉപയോഗിക്കാത്തത് കൊണ്ട് ഗ്രന്ഥക്കാർക്ക് പെട്ടെന്ന് മനസ്സിലാവാൻ വേണ്ടി ചെയ്തതാണ്.
    'ऒ': 'ഒ', 'ओ': 'ഓ', 'औ': 'ഔ',
    'अं': 'അം', 'अः': 'അഃ',  #ഇത് വായിക്കാൻ സാധ്യതയി‍ല്ല, എന്തെന്നാ‍ൽ രണ്ടക്ഷരം
    
    # വ്യഞ്ജനാക്ഷരങ്ങൾ
    'क': 'ക', 'ख': 'ഖ', 'ग': 'ഗ', 'घ': 'ഘ', 'ङ': 'ങ', #കണ്ഠ്യം
    'च': 'ച', 'छ': 'ഛ', 'ज': 'ജ', 'झ': 'ഝ', 'ञ': 'ഞ', #താലവ്യം
    'ट': 'ട', 'ठ': 'ഠ', 'ड': 'ഡ', 'ढ': 'ഢ', 'ण': 'ണ', #മൂർദ്ധന്യം
    #(വർത്സ്യം താഴെ ഉണ്ട്.)
    'त': 'ത', 'थ': 'ഥ', 'द': 'ദ', 'ध': 'ധ', 'न': 'ന', #ദന്ത്യം
    'प': 'പ', 'फ': 'ഫ', 'ब': 'ബ', 'भ': 'ഭ', 'म': 'മ', #ഓഷ്ഠ്യം
    
    # വർത്സ്യവ്യഞ്ജനം
    'ट़': 'ഺ', #വർത്സ്യഖരം. സ്വരചിഹ്നം ഉപയോഗിക്കാനുള്ള സംവിധാനം കുറച്ച് അരൂപികളിലേ ഉള്ളൂ. Noto Sans Malayalam ഉപയോഗിക്കുക. ഇവിടെ ഇത് പാകില്ല. നുക്താക്ഷരങ്ങളിൽ വക്കുന്നു.
    'ऩ': 'ഩ', #വർത്സ്യാനുനാസിക. ഇത് UniCodeൽ ഉണ്ടെങ്കിലും അരൂപികളിൽ പലതും സ്വരചിഹ്നത്തോട് ചേർക്കാൻ സമ്മതിക്കുന്നില്ല. എന്നിരുന്നാലും ൻ എന്നതിനോട് ബന്ധിപ്പിച്ചിട്ടുണ്ട്. Noto Sans Malayalam ഉപയോഗിക്കുക.
    
    # മലയാളത്തിൽ വ്യഞ്ജനാക്ഷരവർഗങ്ങളിൽ ദന്ത്യക്ക് (ത വർഗം) മുമ്പ് വരുന്നതാണ് വർത്സ്യം. അതിലുള്ള ഖരാക്ഷരം (ത പോലെ) ആണ് ഺ. അതിൽ അനുനാസികം (ന പോലെ) ആണ് ഩ. മറ്റു മൂന്നെണ്ണം (അതിഖരം, മൃദു, ഘോഷം) ഈ വർത്സ്യവർഗത്തിൽ ഇല്ല. ഺ എന്നതിനെയാണ് നമ്മൾ റ്റ എന്ന് വച്ച് എഴുതുന്നത്. ഩ എന്നത് ഇപ്പോൾ ഒരു നിയമം മാത്രമാക്കി, അതായത് ശബ്ദത്തിൻറ്റെ തുടക്കത്തിൽ വന്നാൽ ന എന്നും, തുടക്കത്തിൽ അല്ലെങ്കിൽ ന എന്ന് എഴുതിയാലും ഩ എന്ന് ഉച്ഛരിക്കണം എന്നും. അഥവ ന എന്ന ഉച്ഛാരണം തന്നെ വേണമെങ്കിൽ രണ്ട് ന (ന്ന) ഒരുമിച്ച് എഴുതണം. പക്ഷെ ഈ നിയമം മാത്രം പോര, എന്തെന്നാൽ 'എൻഩെ' (എനിക്ക് എന്ന രീതിയിൽ അർഥം) എന്നതും 'എന്നെ' (എപ്പോഴെ എന്ന അർഥം) എന്നതും വേറെയാണ്. അത് പോലെ, എൻഩാൽ (എന്ഩെകൊണ്ട് എന്ന അർഥം) എന്നാൽ (പക്ഷെ എന്ന് അർഥം) എന്നതും വേറെയാണ്.
    
    
    'य': 'യ', 'र': 'ര', 'ल': 'ല', 'व': 'വ', #സ്വരവ്യഞ്ജനമധ്യമങ്ങൾ
    'श': 'ശ', 'ष': 'ഷ', 'स': 'സ', #ഊഷ്മാക്കൾ
    'ह': 'ഹ', #ഘോഷി
    'ऴ': 'ഴ', 'ऱ': 'റ', 'ळ': 'ള', #ജിഹ്വ്യം (ഇങ്ങനെയല്ല ഇതിനെ പൊതുവെ വിളിക്കുന്നത്, പക്ഷെ ജിഹ്വ വളക്കുന്നതാണ് ഇതിൽ പ്രധാനം)
    
    # മാത്രകൾ (സ്വരാക്ഷര ചിഹ്നങ്ങൾ)
    'ा': 'ാ', 'ि': 'ി', 'ी': 'ീ', 'ु': 'ു', 'ू': 'ൂ', 'ृ': 'ൃ',
    'ॆ': 'േ', 'े': 'െ', 'ै': 'ൈ', 'ॊ': 'ൊ', 'ो': 'ോ', 'ौ': 'ൌ',
    'ं': 'ം', 'ः': 'ഃ',
    'ऽ': 'ഽ',

    
    '्': '്', # അക്ഷര വിരാമം  
    'ँ': 'ഁ', # ചന്ദ്രബിന്ദു. ഇങ്ങനെയും എഴുതാം: '\u0901': '\u0D01',

    '‍': '' # ശൂന്യ വലുപ്പമുള്ള പ്രതീകം. എന്തിനാ͏ണെന്ന് ഓർമയില്ല.
    
}

വാക്യവിരാമം = {
'।':'.', #വാക്യ-വിരാമം. 
'–':'൹' #സംഖ്യ വിരാമം.
}

ചില്ലക്ഷരം = {
    #ചില്ലക്ഷരങ്ങളും റ്റ-കളും
    'ऩ्': 'ൻ',  'ण़्': 'ൺ', # 'ऩ्': 'ൻ' എന്നതിന് പകരം. രണ്ടും വേറെ വേറെ ആണ്. ഒന്നിൽ നുക്തം, മറ്റേത് സ്വതവേ.
    
    #'‍ऴ': 'ള', '‍ल़': 'ല', #മലയാളത്തിൽ ചെറിയ മാഺം. എന്തെന്നാൽ നമ്മൾ കൂടുതലും ൽ, ൾ ആണ് ഉപയോഗിക്കുന്നത്. ഇതിൽ മൂന്നെണ്ണം ഉണ്ട് എന്നാൽ മാറ്റുമ്പോൾ രണ്ടും. വിരാമം മാറ്റിയാൽ രണ്ടും ഒന്നും. അത് കൊണ്ട് ഇത് നേരെ പാകുന്നില്ല. നുക്തം വെറുതെ കിടന്ന് നുക്തം എന്ന പാകൽ-ഭാഗം ആണ് ഉപയോഗമാവുന്നത്.
    
    'र्': 'ർ', 'ळ्': 'ൾ', 'ल्': 'ൽ',  #മലയാളത്തിൽ ചെറിയ മാഺം. എന്തെന്നാൽ നമ്മൾ കൂടുതലും ർ, ൽ, ൾ ആണ് ഉപയോഗിക്കുന്നത്. ഇവിടെ എന്ത് കൊണ്ടോ ഇവിടെ ശരിയാകുന്നില്ല, താഴെ (നുക്താക്ഷരത്തി‍ൽ) ശരിയാകുന്നുണ്ട്.
    'ळ्ळ':'ള്ള', 'ल्ल':'ല്ല',
    
    'म़्': 'ം', 'क़्': 'ൿ', 'य़्': 'ൕ', 'ऴ़्': 'ൖ', #ഇവയിൽ എല്ലാം നുക്തം ഉണ്ട്.
    
    'र्य': 'ര്യ', # ഇത് ഒരു പ്രത്യേക സാഹചര്യം ആണ്, നമ്മൾ സാധാരണ ര് നെ ർ ആക്കിയത് കൊണ്ട്.

    'ऱ्': 'ര്', 'ऱ़्': 'ർ', #​മലയാള ർ-കളിൽ ഒരെണ്ണം U+0D31ഉം, മറ്റേത് U+0D30 + U+0D4Dഉം ആണ്, തിരിച്ച് മാറ്റാനായി. നാഗരിയിലെ ഒന്നിൽ നുക്തവും മറ്റേത് സ്വതവേ ഉള്ള രൂപവും ആണ്.
    'ऱ्र्': 'റ്റ്', 'ऱ्र': 'റ്റ', 'ऱ्ऱ्': 'റ്റ' #റ്റ-കളും ഇതിൽ തന്നെ.
}

നുക്താക്ഷരം = { 
    
    'र्': 'ർ', 'ळ्': 'ൾ', 'ल्': 'ൽ', # എന്ത് കൊണ്ടോ ഇവിടെ ശരിയാകുന്നു, മുകളി‍ൽ ശരിയാകുന്നില്ല. രണ്ട് ചിഹ്നങ്ങൾ മാത്രം ഉള്ളത് കൊണ്ടാവാം. മുകളി‍ൽ ബാക്കിയെല്ലാം മൂന്ന് അല്ലെ. നമുക്ക് കൂടുതലും വേണ്ടത് ർ, ‍ൽ, ൾ എന്നിവയാണ്. 
    '‍ऴ': 'ള', '‍ल़': 'ല',
    
    'ट़': 'ഺ', #സാധാരണാക്ഷരങ്ങളി‍ൽ ശരിയാകാത്ത കൊണ്ട്.
    
    # ஃ എന്നത് തമിഴിലെ ഉള്ളു. മലയാളത്തിൽ ഉള്ളതൊന്നും അരൂപിയിൽ പ്രവർത്തിക്കുന്നില്ല. നുക്തം എന്ന ഭാഗത്തിന് മുമ്പേ പാകണം. 
    'व़': 'ஃവ', # ചുണ്ട് പുറത്തേക്കാക്കി കൂട്ടിപിടിച്ച് പറയുന്ന വ (w). മറ്റേത് മുകളിലത്തെ പല്ലുകൾ താഴത്തെ ചുണ്ടിൽ മുട്ടിച്ച് പറയുന്നു (v). ഇത് നേപാളിൽ ഉപയോഗിക്കും.
    'ज़': 'ஃസ', # ജ്സ എന്നാണ് വായിക്കുക. ഈ ശബ്ദമുള്ള വാക്ക് ഹിന്ദിയിൽ കേട്ടാൽ അതിനർഥം അത് ശുദ്ധഹിന്ദി അല്ലെന്നും പാഴ്സിയൊ, അറബികൊ ആണെന്നും അർഥം.
    'फ़': 'ஃഫ', #പുറത്തേക്ക് ഊതി 'വ' എന്ന് പറയുന്ന ഉച്ഛാരണം. വേണമെങ്കിൽ ஃഫ എന്നതിന് '൧' ും ഉപയോഗിക്കാം. 
    'य़': 'ஃയ', #ൕ എന്ന ചില്ലക്ഷരവും ഉപയോഗിക്കാം. ഇതിൽ സ്വരചിഹ്നങ്ങളും സാധ്യമാണ്. പക്ഷെ ചില അരൂപികളിൽ ഇത് വായിക്കപെടാത്തത് കൊണ്ട്, നമുക്ക് ஃ ഉപയോഗിക്കേണ്ടി വരുന്നു. ഈ ശബ്ദം നേപാളിലേതാണ്.
}

നുക്തം = {
    '़': '‎'  #'\u093C' നെ Left-to-Right Character (LRM) ആയി മാറ്റുന്നു. व़ (വ), फ़(ഫ), य़ (ൕ), ऴ् (ള്), ‍ल़् (ല്) എന്നിവയെ ഭാവിയിൽ തിരിച്ചു മാറ്റാൻ, ഇതെങ്ങാനും ഉപയോഗിക്കുന്നവർ ഉണ്ടെങ്കിൽ. ഇങ്ങനെ നുക്തത്തിന് പകരം ഉപയോഗിക്കാൻ അക്ഷരമില്ലാത്തത് ബുദ്ധിമുട്ടാണ്. നമുക്ക് സ്വന്തമായി UniCodeന് പകരക്കാരൻ ഉണ്ടാക്കേണം.
    
    # ഈ ZWJ, ZWSP, CGJനെ പറ്റിയൊക്കെ അറിയാൻ  - https://learn.microsoft.com/en-us/typography/script-development/malayalam
}
